package me.app17.phonefortune;

import androidx.appcompat.app.AppCompatActivity;

import android.os.Bundle;
import android.view.View;
import android.widget.EditText;
import android.widget.TextView;

public class MainActivity extends AppCompatActivity {


    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);
    }

    public void click(View view) {

        EditText editText = findViewById(R.id.phone_number);

        String number = editText.getText().toString();

        System.out.println(number.toCharArray());

        //取得後四個數字
        double lastFourNumber = Double.valueOf(number.substring(number.length() - 4));

        double total = lastFourNumber / 80;

        //轉型成字串
        String tempNumber = String.valueOf(total);

        int resultNumber = (int) (Double.valueOf(tempNumber.substring(tempNumber.indexOf('.'))) * 80);

        System.out.println(total);

        TextView result = findViewById(R.id.result);
        TextView info = findViewById(R.id.info);

        result.setText(EVALUATION[resultNumber-1][1]);

        info.setText(lastFourNumber + " " + tempNumber + " " + resultNumber+"\n"+"");
        info.setText(EVALUATION[resultNumber-1][0]);

        ((TextView)findViewById(R.id.number)).setText(String.valueOf(resultNumber));


    }

    private final String[][] EVALUATION = {

            {"大展鴻圖，信用得固，無運弗異，可獲成功", "吉"},

            {"根基不固，搖搖欲墮，一盛一衰，勞而無功", "凶"},

            {"根深蒂固，蒸蒸日上，如意吉祥，百事願遂", "吉"},

            {"坎坷前途，苦難折磨，非有毅力，難忘成功", "凶"},

            {"陰陽和合，生意欣榮，名利雙收，後福重重", "吉"},

            {"萬寶雲集，天降幸運，立志奮發，可成大功", "吉"},

            {"專心經營，和氣致祥，排除萬難，必獲成功", "吉"},

            {"努力發達，貫徹志望，不忘進退，成功可期", "吉"},

            {"雖包奇才，有才無命，獨營無力，財利無望", "凶"},

            {"烏雲遮月，暗淡無光，空費心力，徒勞無功", "凶"},

            {
                    "草木逢春，枯木潔露，穩健著實，必得人望", "吉"
            },

            {
                    "薄弱無力，孤立無搖，外祥內苦，謀事難成", "凶"
            },

            {
                    "天賦吉運，能得人望，善用智慧，必獲成功", "吉"
            },

            {
                    "忍得苦難，必有後福，是成是敗，惟靠堅毅", "凶"
            },

            {
                    "謙恭做事，必得人和，大事成就，一定興隆", "吉"
            },
            {
                    "能獲眾望，成就大業，名利雙收，盟主四方", "吉"
            },

            {
                    "排除萬難，有貴人助，把握時機，可得成功", "吉"
            },

            {
                    "經商做事，順利昌隆，如能慎始，百事亨通", "吉"
            },
            {
                    "成功雖早，慎防空慮，內外不合，障礙重重", "凶"
            },

            {
                    "智高志大，歷盡艱難，焦心憂勞，進退兩難", "凶"
            },

            {
                    "專心經營，善用智慧，霜花梅花，春來怒放", "吉"
            },
            {
                    "秋草逢霜，懷才不遇，憂愁怨苦，事不如意", "凶"
            },
            {
                    "旭日升天，名顯四方，漸次進展，終成大業", "吉"
            },
            {
                    "錦繡前程，須靠自力，多遙智謀，能奏大功", "吉"
            },
            {
                    "天時地利，再造人格，講信修睦，即可成功", "吉"
            },
            {
                    "波瀾起伏，千變萬化，淩駕萬難，必可成功", "凶"
            },
            {
                    "一成一敗，一盛一衰，惟靠謹慎，可守成功", "凶帶吉"
            },
            {
                    "魚臨旱地，難逃惡運，此數大凶，不如更名", "凶"
            },
            {
                    "如龍得雲，青雲直上，智謀奮進，才略奏功", "吉"
            },
            {
                    "吉凶參半，得失相伴，投機取巧，如賽一樣", "凶"
            },
            {
                    "此數大吉，名利雙收，漸進向上，大業成就", "吉"
            },
            {
                    "池中之龍，風雲際會，一躍上天，成功可望", "吉"
            },
            {
                    "不可意氣，善用智慧，如能慎始，必可昌隆", "吉"
            },
            {
                    "災難不絕，難望成功，此數大凶，不如更名", "凶"
            },
            {
                    "中吉之數，進退保守，生意安穩，成就可期", "吉"
            },
            {
                    "波瀾重疊，長陷窮困，動不如靜，有才無命", "凶"
            },
            {
                    "逢凶化吉，吉人天相，風調雨順，生意興隆", "吉"
            },
            {
                    "名雖可得，利則難獲，藝界發展，可望成功", "凶帶吉"
            },
            {
                    "雲間見月，雖有勞碌，光明坦途，指日可期", "吉"
            },
            {
                    "一盛一衰，浮沉不定，知難而退，自獲天信", "吉帶凶"
            },
            {
                    "天賦吉運，德望兼備，繼續努力，前途無限", "吉"
            },
            {
                    "事業不專，十九不成，專心進取，可望成功", "吉帶凶"
            },
            {
                    "雨夜之花，外祥內苦，忍耐自重，轉凶化吉", "吉帶凶"
            },
            {
                    "雖用心計，事難遂願，貪功好進，必招失敗", "凶"
            },
            {
                    "楊柳遇春，綠葉發枝，衝破難關，一舉成名", "吉"
            },
            {
                    "坎坷不平，艱難重重，若無耐心，難望有成", "凶"
            },
            {
                    "有貴人助，可成大業，雖遇不幸，浮沉不大", "吉"
            },
            {
                    "美化豐寶，鶴立雞群，名利俱全，繁榮富貴", "吉"
            },

            {
                    "遇吉則吉，遇凶則凶，唯靠謹慎，逢凶化吉", "凶"
            },

            {
                    "凶吉互見，一成一敗，凶中有吉，吉中有凶", "吉帶凶"
            },
            {
                    "一盛一衰，浮沉不常，自重自慮，可保平安", "吉帶凶"
            },

            {
                    "草木逢春，雨過天晴，渡過難關，即獲成功", "吉"
            },

            {
                    "盛衷參半，外祥內苦，先吉後凶，先凶後吉", "吉帶凶"
            },
            {
                    "雖傾全力，難望成功，此數大凶，最好改名", "凶"
            },
            {
                    "外觀昌隆，內隱禍患，克服難關，間出泰運", "吉帶凶"
            },
            {
                    "事與願違，終難成功，欲速不達，有始有終", "凶"
            },
            {
                    "努力經營，時來運轉，曠野枯草，春來花開", "吉"
            },
            {
                    "半凶半吉，浮沉多端，始凶終吉，能保成功", "凶帶吉"
            },
            {
                    "遇事遲疑，難望成事，大刀闊斧，始可有成", "凶"
            },
            {
                    "黑暗無光，心迷意亂，出爾反爾，難定方針", "凶"
            },
            {
                    "雲遮半月，百隱風波，應自謹慎，始保平安", "吉帶凶"
            },
            {
                    "煩悶懊惱，事事難展，自防災禍，始免困境", "凶"
            },
            {
                    "萬物化盲，繁榮之源，專心一意，始能成功", "吉"
            }, {
            "見異思遷，十九不成，徒勞無功，不如更名", "凶"
    },
            {
                    "吉運自來，能享盛名，把握機會，必獲成功", "吉"
            },
            {
                    "黑夜漫長，進退維谷，內外不和，信用缺乏", "凶"
            },
            {
                    "時來運轉，事事如意，功成名就，富貴自來", "吉"
            },
            {
                    "思慮周詳，計畫有力，不失先機，渴望成功", "吉"
            },
            {
                    "動搖不安，常陷逆境，不得時運，難得利潤", "凶"
            },
            {
                    "慘澹經營，難免貧困，此數不吉，最好更名", "凶"
            },
            {
                    "吉凶參半，惟賴勇氣，貫徹力行，始可成功", "吉帶凶"
            },
            {
                    "凶吉難測，凶多吉少，得而得失，難以安置", "凶"
            },
            {
                    "安樂自來，自然吉祥，力行不懈，終必成功", "吉"
            },
            {
                    "富不及貴，坐食山空，如無智謀，難望成功", "凶"
            },
            {
                    "吉中帶凶，欲速不達，進不如守，可保安詳", "吉帶凶"
            },
            {
                    "此數大凶，破產之象，宜速改名，以避厄運", "凶"
            },
            {
                    "先苦後甜，先甘後苦，如能守成，不致失敗", "吉帶凶"
            },
            {
                    "有得有失，華而不實，須保劫財，始保平安", "吉帶凶"
            },
            {
                    "如走夜路，前途無光，希望不大，勞而無功", "凶"
            },
            {
                    "得而復失，枉費心機，守成無貪，可保安穩", "吉帶凶"
            },
            {
                    "最極之數，還本歸元，能得繁榮，發達成功", "吉"
            },


    };


}